/*	
Училище - Технологично училище "Електронни системи" към ТУ-София 
Клас - 11Б клас
Номер - 3
Име - Анна-Мария Верева Матейна
Задача - Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери първото число N в интервала [0; +∞) делящо се на х. Да се намери сумата на всички числа в интервала [0; N] и да се запише като първи елемент в масива. Да се намери второто число N' в интервала [0; +∞) делящо се на x. Да се намери сумата на всички числа в интервала [0, N'] и да се запише като втори елемент в масива. Аналогично да се запълнят и останалите елементи на масива. Масивът да се изведе на стандартния изход.
*/

#include<stdio.h>

void main(){
	int x,counter,c,sum,n;
	int array[10];
	do{
		printf("Enter x (0<x<10) \n");
		scanf("%d",&x);
	} 
	while ((x<0) || (x>10));
	counter=0;
	c=1;
	do{
		if (c%x==0){
			sum=0;
			for(n=1;n<c;n++){
				sum+=n;
			}
			array[counter]=sum;
			counter++;
		}
		c++;
	}
	while (counter<10);
	for(counter=0;counter<10;counter++){
		printf("Sum :%d\n",array[counter]);
	}
}
