/*	
Училище - Технологично училище "Електронни системи" към ТУ-София 
Клас - 11Б клас
Номер - 3
Име - Анна-Мария Верева Матейна
Задача - Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери сумата от всички числа в интервала [0; 1000) делящи се на x и да се запише като първа стойност в масива. Да се намери сумата от всички числа в интервала [0;1000) деляща се на 2x и да се запише като втора стойност в масива. Аналогично да се намери сумата на всички числа делящи се на Nx за N в интервала [1;10] и да се запишат като елемент N-1 в масива. Масивът да се изведе на стандартния изход.
*/

#include<stdio.h>

void main(){
	int x,counter,c,sum,temp;
	int array[10];
	do{
		printf("Enter x (0<x<10) \n");
		scanf("%d",&x);
	} 
	while ((x<1) || (x>10));
	counter=0;
	temp=x;
	do{
		sum=0;
		for(c=1;c<1000;c++){
			if(c%x==0){
				sum+=c;
			}
		}
		array[counter]=sum;
		counter++;
		x+=temp;
	} 
	while (counter<10);
	for(counter=0;counter<10;counter++){
		printf("Sum :%d\n",array[counter]);
	}
}
