/*	
Училище - Технологично училище "Електронни системи" към ТУ-София 
Клас - 11Б клас
Номер - 3
Име - Анна-Мария Верева Матейна
Задача - Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери първото просто число в интервала [0; +∞) завършващо на x и да се запише като първи елемент в масива. Да се намери второто просто число в интервала [0; +∞) завършващо на x и да се запише като втори елемент в масива. Аналогично да се намерят първите N прости числа в интервала [0; +∞) и да се запишат като елемент N в масива. Масивът да се изведе на стандартния изход.
*/

#include<stdio.h>

void main(){
	int x,c,counter,n,test;
	int array[10];
	do{
		printf("Enter x (0<x<10) \n");
		scanf("%d",&x);
	} 
	while ((x<=0) || (x>10));
	n=0;
	for(c=1;c<1000;c++){	
		test=0;
		counter=2;
		do{
				if ((c%counter)==0){
					test++;
				} 
				counter++;
		} 
		while ((test==0) && (counter<c));
		if ((test==0) && ((c%10)==x)){
			array[n]=c;
			n++;
		}
		if (n==9){
			break;
		}
	}
	for(counter=0;counter<9;counter++){
		printf("Number :%d\n",array[counter]);
	}
}
