/*	
Училище - Технологично училище "Електронни системи" към ТУ-София 
Клас - 11Б клас
Номер - 3
Име - Анна-Мария Верева Матейна
Задача - Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<=x<10. Да се инициализира масив от 10 елемента. Да се намерят първите 10 числа на Фибоначи в [0; +∞), които се делят на x без остатък. Намерените стойности да се зададат като стойности на елементите в масива. Елементите на масива да се изведат на стандартния изход.
*/

#include<stdio.h>

void main(){
	int x,counter,fx,fy,fsum;
	int array[10];
	do{
		printf("Enter x (0<=x<10) \n");
		scanf( "%d" , &x);
	} 
	while ((x<=1) || (x>=10));
	counter=0;
	fx=0;
	fy=1;
	do{
		fsum=fx+fy;
		if ((fsum%x)==0){
			array[counter]=fsum;
			counter++;
		}
		fx=fy;
		fy=fsum;
	} 
	while (counter<10);
	for(counter=0;counter<10;counter++){
		printf("Number:%d\n",array[counter]);
	}
}
